src/Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Событие</Name>
			<Comment>Предварительная запись клиента</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминанияДоЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиЗаписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеРезерва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренесённаяПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолисМедСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолисыМедицинскогоСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаРезерва</Name>
					<Comment>Цвет фона резерва</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакЗаблокированно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗаписи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныЗаписи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИсторияПереносовСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияПереносовСобытий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/КонтрагентыСведенияДляСписка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КонтрагентыСведенияДляСписка</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПервогоПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнегоПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПриемов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапланированнаяПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледующегоПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>95</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийЭтапСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭтапыСделок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСделки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследняяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Взаимодействие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследняяЗадачаПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СледующаяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Взаимодействие</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СледующаяЗадачаПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ДанныеЗаписейКалендаряGoogle.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеЗаписейКалендаряGoogle</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ETag</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредыдущийКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/Событие/Ext/ObjectModule.bsl
#Если Сервер Или ВнешнееСоединение Или ТолстыйКлиентОбычноеПриложение Тогда

#Область ОбработчикиСобытий

// Процедура, обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		Статус = Перечисления.СтатусыСобытия.НеПодтверждена;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИсточникЗаписи) Тогда 
		ИсточникЗаписи = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ИсточникиЗаписей.Администратор");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(АвторДокумента) Тогда
		АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ТипСобытия) Тогда
		ТипСобытия = Перечисления.ТипыСобытий.ПредварительнаяЗапись;
	КонецЕсли;
	
	ВидЦен = ?(Не СтруктурнаяЕдиница.ВидЦенРеализации.Пустая(), СтруктурнаяЕдиница.ВидЦенРеализации, Справочники.ВидыЦен.Розничная);

	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, , ДанныеЗаполнения);
	
КонецПроцедуры

// Процедура, обработчик события "ПриКопировании".
//
Процедура ПриКопировании(ОбъектКопирования)	
	
	ЭтотОбъект.Дата 					= Дата(1,1,1);
	ЭтотОбъект.ДатаСоздания 			= ТекущаяДатаСеанса();
	ЭтотОбъект.СтруктурнаяЕдиница 		= ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;	
	ЭтотОбъект.АвторДокумента 			= ПараметрыСеанса.ТекущийПользователь;	
	ЭтотОбъект.Статус        			= Перечисления.СтатусыСобытия.НеПодтверждена;
	ЭтотОбъект.ПричинаОтмены 			= Неопределено;
	ЭтотОбъект.КодСинхронизации 		= "";
	ЭтотОбъект.СсылкаНаПрием 			= Неопределено;
	ЭтотОбъект.Сделка		  			= Неопределено;
	ЭтотОбъект.ТелефонныйЗвонок	 		= Неопределено;
	ЭтотОбъект.ИдентификаторДиалога 	= Неопределено;
	ЭтотОбъект.ВидЦен 					= ?(Не СтруктурнаяЕдиница.ВидЦенРеализации.Пустая(), СтруктурнаяЕдиница.ВидЦенРеализации, Справочники.ВидыЦен.Розничная);
	ЭтотОбъект.УИД 						= ""; 
	
	ЭтотОбъект.Услуги.Очистить(); 
	
	// Нельзя оставлять ТЧ Услуг без единой строки.
	НоваяСтрокаУслуги = ЭтотОбъект.Услуги.Добавить();
	НоваяСтрокаУслуги.ДатаНачала    = ТекущаяДатаСеанса();
	НоваяСтрокаУслуги.ДатаОкончания = НоваяСтрокаУслуги.ДатаНачала + 3600;
	НоваяСтрокаУслуги.НормаВремени  = (НоваяСтрокаУслуги.ДатаОкончания - НоваяСтрокаУслуги.ДатаНачала) / 60;
	
	// Заполнение реквизитов документа по умолчанию
	ОбщегоНазначенияСтоматология.ЗаполнитьРеквизитыОбъектаПоУмолчанию(ЭтотОбъект, ОбъектКопирования);
	
КонецПроцедуры

// Процедура, обработчик события "ОбработкаПроверкиЗаполнения".
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Табличная часть должна быть обязательна заполнена, 
	// Есть случаи, не понятно как, но ТЧ пустая.
	Если Не ЗначениеЗаполнено(Услуги) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СтруктураДоступногоВремени = Новый Структура("ВремяНачалаРазрешено, ВремяОкончанияРазрешено", Неопределено, Неопределено);
	Если Резерв И НЕ ЗначениеЗаполнено(Услуги[0].Сотрудник) Тогда
		ИндМассива = ПроверяемыеРеквизиты.Найти("Услуги.Сотрудник");
		Если НЕ ИндМассива = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(ИндМассива);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.ИдентификаторДиалога <> ЭтотОбъект.Ссылка.ИдентификаторДиалога Тогда 
		Возврат;
	КонецЕсли;
	
	// Проверка правельности заполнения времени
	Для Каждого СтрокаТЧ Из Услуги Цикл
		Если СтрокаТЧ.ДатаНачала > СтрокаТЧ.ДатаОкончания И НЕ НачалоДня(СтрокаТЧ.ДатаОкончания) = СтрокаТЧ.ДатаОкончания Тогда
			ТекстСообщения = НСтр("ru = 'Время начала события, больше времени окончания события!'");
			ОбменДаннымиСервер.СообщитьОбОшибке(ТекстСообщения, Отказ);
		КонецЕсли;
		// Если (СтрокаТЧ.ДатаНачала = СтрокаТЧ.ДатаОкончания) И (НЕ НачалоДня(СтрокаТЧ.ДатаНачала) = СтрокаТЧ.ДатаНачала И НЕ НачалоДня(СтрокаТЧ.ДатаОкончания) = СтрокаТЧ.ДатаОкончания) Тогда
		//	ТекстСообщения = НСтр("ru = 'Не задана продолжительность события!'");
		//	ОбменДаннымиСервер.СообщитьОбОшибке(ТекстСообщения, Отказ);
		// КонецЕсли;
	КонецЦикла;
	
	СписокСотрудников = Новый СписокЗначений;
	СписокСотрудников.ЗагрузитьЗначения(Услуги.ВыгрузитьКолонку("Сотрудник"));
	
	СписокПомещений = Новый СписокЗначений;
	СписокПомещений.ЗагрузитьЗначения(Услуги.ВыгрузитьКолонку("Помещение"));		
	
	Если ПараметрыСеанса.ТекущийПользователь.РольПользователя = Перечисления.РольПользователя.Врач Тогда
		РазрешитьЗаписьКДругомуВрачу = Пользователи.ПолучитьЗначениеПраваПользователя("РазрешитьЗаписьКДругомуВрачу");
		Если НЕ РазрешитьЗаписьКДругомуВрачу Тогда			
			
			Если ЗначениеЗаполнено(Услуги[0].Сотрудник) И Услуги[0].Сотрудник <> ПараметрыСеанса.ТекущийПользователь.Сотрудник Тогда
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Текущему врачу запрещено создавать предварительные записи к другим врачам!");
				Отказ = Истина;
				Возврат;
				
			КонецЕсли;	
			
		КонецЕсли;                           	
	КонецЕсли;	
	
	// Проверка занятости помещения.
	Если Услуги.Количество() > 0 И ЗначениеЗаполнено(Услуги[0].Помещение) Тогда
		
		ДатаНачалаЗаписи =  Услуги[0].ДатаНачала;
		ДатаОкончанияЗаписи = Услуги[Услуги.Количество()-1].ДатаОкончания;
		
		НаличиеСобытийЗаУказаныйПериод = Документы.Событие.НаличиеСобытийЗаУказаныйПериод(ДатаНачалаЗаписи, ДатаОкончанияЗаписи, СтруктурнаяЕдиница,, Услуги[0].Помещение, Ссылка);	
		Если НаличиеСобытийЗаУказаныйПериод = Истина Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Помещение %1 занято в указанное время.", Услуги[0].Помещение));
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	//
	//// Проверка на занятость сотрудника
	// Запрос = Новый Запрос;
	// Запрос.Текст = 
	// "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	УслугиСобытия.Ссылка КАК Событие,
	//|	УслугиСобытия.Сотрудник КАК Сотрудник,
	//|	УслугиСобытия.ДатаНачала КАК ДатаНачала,
	//|	УслугиСобытия.ДатаОкончания КАК ДатаОкончания
	//|ИЗ
	//|	Документ.Событие.Услуги КАК УслугиСобытия
	//|ГДЕ
	//|	УслугиСобытия.Ссылка.Проведен = ИСТИНА
	//|	И УслугиСобытия.Ссылка.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
	//|	И УслугиСобытия.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	//|	И УслугиСобытия.Сотрудник В(&СписокСотрудников)
	//|	И УслугиСобытия.Ссылка <> &ТекущийДокумент
	//|	И НАЧАЛОПЕРИОДА(УслугиСобытия.ДатаНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)";	
	// Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	// Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	// Запрос.УстановитьПараметр("ДатаНачала",  ?(Услуги.Количество() > 0, Услуги[0].ДатаНачала, Дата(01, 01, 01)));
	// ВыборкаРезультат = Запрос.Выполнить().Выгрузить();
	// Для Каждого СтрокаТЧ из Услуги Цикл
	//	Если ЗначениеЗаполнено(СтрокаТЧ.Сотрудник) И ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизитаСотрудника(СтрокаТЧ.Сотрудник, СтруктурнаяЕдиница, "РазрешитьПриемНесколькихПациентов") <> Истина Тогда 
	//		Для Каждого СтрокаСотр из ВыборкаРезультат Цикл
	//			Если СтрокаТЧ.Сотрудник = СтрокаСотр.Сотрудник И ((СтрокаСотр.ДатаОкончания - СтрокаТЧ.ДатаНачала)*(СтрокаТЧ.ДатаОкончания - СтрокаСотр.ДатаНачала) > 0) Тогда
	//				
	//				Если Не ДополнительныеСвойства.Свойство("НеВыводитьСообщение") Тогда
	//					Сообщить("Сотрудник """ + Строка(СтрокаСотр.Сотрудник) + """ в указанное время участвует в предварительной записи """ 
	//					+ Строка(СтрокаСотр.Событие.Номер) + """ с "+Формат(СтрокаСотр.ДатаНачала, "ДФ=HH:mm")+" по "+Формат(СтрокаСотр.ДатаОкончания, "ДФ=HH:mm")+" !");
	//				КонецЕсли;
	//				
	//				Отказ = Истина; 
	//				
	//				ВремяНачалаРазрешено = ?(СтрокаСотр.ДатаОкончания > СтрокаТЧ.ДатаНачала, СтрокаСотр.ДатаОкончания, СтрокаТЧ.ДатаНачала);  				
	//				ВремяОкончанияРазрешено = ?(СтрокаТЧ.ДатаОкончания > СтрокаСотр.ДатаНачала, СтрокаСотр.ДатаНачала, СтрокаТЧ.ДатаОкончания);					
	//				СтруктураДоступногоВремени.Вставить("ВремяНачалаРазрешено"   , ВремяНачалаРазрешено);
	//				СтруктураДоступногоВремени.Вставить("ВремяОкончанияРазрешено", ВремяОкончанияРазрешено);	
	//				ДополнительныеСвойства.Вставить("СтруктураДоступногоВремени", СтруктураДоступногоВремени);
	//				
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;
	// КонецЦикла;
	//	
	//// Проверка на занятость помещения
	// Запрос = Новый Запрос;
	// Запрос.Текст = 
	// "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	УслугиСобытия.Ссылка КАК Событие,
	//|	УслугиСобытия.Помещение КАК Помещение,
	//|	УслугиСобытия.ДатаНачала КАК ДатаНачала,
	//|	УслугиСобытия.ДатаОкончания КАК ДатаОкончания
	//|ИЗ
	//|	Документ.Событие.Услуги КАК УслугиСобытия
	//|ГДЕ
	//|	УслугиСобытия.Ссылка.Проведен = ИСТИНА
	//|	И УслугиСобытия.Ссылка.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
	//|	И УслугиСобытия.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	//|	И УслугиСобытия.Помещение В(&СписокПомещений)
	//|	И УслугиСобытия.Ссылка <> &ТекущийДокумент
	//|	И НАЧАЛОПЕРИОДА(УслугиСобытия.ДатаНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)";	
	// Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	// Запрос.УстановитьПараметр("СписокПомещений", СписокПомещений);
	// Запрос.УстановитьПараметр("ДатаНачала",  ?(Услуги.Количество() > 0, Услуги[0].ДатаНачала, Дата(01, 01, 01)));
	// ВыборкаРезультат = Запрос.Выполнить().Выгрузить();
	// Для Каждого СтрокаТЧ из Услуги Цикл
	//	Для Каждого СтрокаСотр из ВыборкаРезультат Цикл
	//		Если СтрокаТЧ.Помещение = СтрокаСотр.Помещение И Не СтрокаСотр.Помещение.Пустая()
	//			И (СтрокаТЧ.ДатаНачала > СтрокаСотр.ДатаНачала И СтрокаТЧ.ДатаНачала < СтрокаСотр.ДатаОкончания 
	//			ИЛИ СтрокаТЧ.ДатаОкончания > СтрокаСотр.ДатаНачала И СтрокаТЧ.ДатаОкончания < СтрокаСотр.ДатаОкончания
	//			ИЛИ СтрокаСотр.ДатаНачала > СтрокаТЧ.ДатаНачала И СтрокаСотр.ДатаНачала < СтрокаТЧ.ДатаОкончания 
	//			ИЛИ СтрокаСотр.ДатаОкончания > СтрокаТЧ.ДатаНачала И СтрокаСотр.ДатаОкончания <= СтрокаТЧ.ДатаОкончания) Тогда
	//			
	//			Сообщить("Помещение """ + Строка(СтрокаСотр.Помещение) + """ занято предварительной записью """ + Строка(СтрокаСотр.Событие.Номер) + """ с "+Формат(СтрокаСотр.ДатаНачала, "ДФ=HH:mm")+" по "+Формат(СтрокаСотр.ДатаОкончания, "ДФ=HH:mm")+" !");
	//			Отказ = Истина;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	// КонецЦикла;	

#Область Неиспользуемые_проверки

	//// Проверка по сотрудникам
	// Запрос = Новый Запрос("ВЫБРАТЬ
	//					  |		ГрафикРаботы.Сотрудник КАК Сотрудник,
	//					  |		ГрафикРаботы.ДатаВремяНачала КАК ДатаНачала,
	//					  |		ГрафикРаботы.ДатаВремяОкончания КАК ДатаОкончания
	//					  |	ИЗ
	//					  |		РегистрСведений.ВремяРаботыСотрудниковПлан КАК ГрафикРаботы
	//					  |	ГДЕ
	//					  |		ГрафикРаботы.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	//					  |		И ГрафикРаботы.Сотрудник В(&СписокСотрудников)
	//					  |		И НАЧАЛОПЕРИОДА(ГрафикРаботы.ДатаВремяНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&НачалоСобытия, ДЕНЬ)");
	// Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	// Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	// Запрос.УстановитьПараметр("НачалоСобытия", ?(Услуги.Количество() > 0, Услуги[0].ДатаНачала, Дата(01, 01, 01)));
	// РаботающиеСотрудники = Запрос.Выполнить().Выгрузить();
	// Для Каждого СтрокаТЧ из Услуги Цикл
	//	Работает = Ложь;
	//	Для Каждого СтрокаСотр из РаботающиеСотрудники Цикл
	//		Если СтрокаТЧ.Сотрудник = СтрокаСотр.Сотрудник И СтрокаТЧ.ДатаНачала >= СтрокаСотр.ДатаНачала И СтрокаТЧ.ДатаОкончания <= СтрокаСотр.ДатаОкончания Тогда
	//			Работает = Истина;
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	Если Не Работает Тогда
	//		Сообщить("Сотрудник: " + СтрокаТЧ.Сотрудник + " не работает в период " + СтрокаТЧ.ДатаНачала + " - " + СтрокаТЧ.ДатаОкончания + " !");
	//		Отказ = Истина;
	//	КонецЕсли;
	// КонецЦикла;
	
	
	//// проверка занятости пациента в других записях
	// Если ЗначениеЗаполнено(Контрагент) Тогда 
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//	|	УслугиСобытия.Ссылка КАК Событие,
	//	|	УслугиСобытия.ДатаНачала КАК ДатаНачала,
	//	|	УслугиСобытия.ДатаОкончания КАК ДатаОкончания
	//	|ИЗ
	//	|	Документ.Событие.Услуги КАК УслугиСобытия
	//	|ГДЕ
	//	|	УслугиСобытия.Ссылка.Проведен = ИСТИНА
	//	|	И УслугиСобытия.Ссылка.ТипСобытия = ЗНАЧЕНИЕ(Перечисление.ТипыСобытий.ПредварительнаяЗапись)
	//	|	И УслугиСобытия.Ссылка.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыСобытия.ПриемОтменен)
	//	|	И УслугиСобытия.Ссылка.Контрагент = &Контрагент
	//	|	И УслугиСобытия.Ссылка <> &ТекущийДокумент
	//	|	И НАЧАЛОПЕРИОДА(УслугиСобытия.ДатаНачала, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаНачала, ДЕНЬ)";	
	//	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	//	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	//	Запрос.УстановитьПараметр("ДатаНачала",  ?(Услуги.Количество() > 0, Услуги[0].ДатаНачала, Дата(01, 01, 01)));
	//	ВыборкаРезультат = Запрос.Выполнить().Выгрузить();
	//	Для Каждого СтрокаТЧ из Услуги Цикл
	//		Для Каждого СтрокаСотр из ВыборкаРезультат Цикл
	//			//(Te2 - Ts1)(Te1 - Ts2) > 0 - пересекаются; <=0 - не пересекаются
	//			Если (СтрокаСотр.ДатаОкончания - СтрокаТЧ.ДатаНачала)*(СтрокаТЧ.ДатаОкончания - СтрокаСотр.ДатаНачала) > 0 Тогда 
	//				Сообщить("Пациент """ + Строка(Контрагент) + """ уже записан в предварительной записи """ + Строка(СтрокаСотр.Событие.Номер) 
	//				+ """ с "+Формат(СтрокаСотр.ДатаНачала, "ДФ=HH:mm")+" по "+Формат(СтрокаСотр.ДатаОкончания, "ДФ=HH:mm")+" !");
	//				Отказ = Истина;
	//				
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЦикла;	
	// КонецЕсли;


	// Если Не Резерв Тогда
	//	ХранилищеСтруктураОбязательныеПоля = Константы.ОбязательныеПоляСобытие.Получить();
	//	СтруктураОбязательныеПоля =  ХранилищеСтруктураОбязательныеПоля.Получить();	
	//	Если СтруктураОбязательныеПоля <> Неопределено И ТипЗнч(СтруктураОбязательныеПоля) = Тип("Структура") Тогда
	//		// Загрузим настройки в проверяемые реквизиты
	//		Для Каждого ЭлементСтруктуры Из СтруктураОбязательныеПоля Цикл
	//			Если ЭлементСтруктуры.Значение = Истина Тогда
	//				Если ЭлементСтруктуры.Ключ = "УслугиПричинаЗаписиПолем" Тогда
	//					Если ЭтотОбъект.Услуги.Количество() = 0 или Не ЗначениеЗаполнено(ЭтотОбъект.Услуги[0].ПричинаЗаписи) Тогда
	//						Сообщение = Новый СообщениеПользователю;
	//						Сообщение.Текст = "Поле ""Причина записи"" не заполнено";
	//						Сообщение.Сообщить();
	//						Отказ = Истина;
	//					КонецЕсли;
	//				ИначеЕсли ЭлементСтруктуры.Ключ = "УслугиСотрудникПолем" Тогда
	//					Если ЭтотОбъект.Услуги.Количество() = 0 или Не ЗначениеЗаполнено(ЭтотОбъект.Услуги[0].Сотрудник) Тогда
	//						Сообщение = Новый СообщениеПользователю;
	//						Сообщение.Текст = "Поле ""Врач"" не заполнено";
	//						Сообщение.Сообщить();
	//						Отказ = Истина;
	//					КонецЕсли;
	//				ИначеЕсли ЭлементСтруктуры.Ключ = "УслугиПомещениеПолем" Тогда
	//					Если ЭтотОбъект.Услуги.Количество() = 0 или Не ЗначениеЗаполнено(ЭтотОбъект.Услуги[0].Помещение) Тогда
	//						Сообщение = Новый СообщениеПользователю;
	//						Сообщение.Текст = "Поле ""Кабинет"" не заполнено";
	//						Сообщение.Сообщить();
	//						Отказ = Истина;
	//					КонецЕсли;
	//				Иначе
	//					ПроверяемыеРеквизиты.Добавить(ЭлементСтруктуры.Ключ);
	//				КонецЕсли;	
	//			КонецЕсли;	
	//		КонецЦикла;
	//	КонецЕсли;	
	// КонецЕсли;

#КонецОбласти	
	
КонецПроцедуры

// Процедура, обработчик события "ПередЗаписью".
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка
		ИЛИ (ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбменДаннымиЗагрузка")
		И ЭтотОбъект.ДополнительныеСвойства.ОбменДаннымиЗагрузка = Истина) Тогда
		
		Возврат;
	КонецЕсли;
	
	// Устанавливаем ссылку нового.
	Если Ссылка.Пустая() И ПолучитьСсылкуНового() = Документы.Событие.ПустаяСсылка() Тогда
		СсылкаНового = Документы.Событие.ПолучитьСсылку(Новый УникальныйИдентификатор);
		УстановитьСсылкуНового(СсылкаНового);
		УИД = СсылкаНового.УникальныйИдентификатор();
	ИначеЕсли НЕ ЗначениеЗаполнено(УИД) Тогда
		УИД = Ссылка.УникальныйИдентификатор();	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ДатаСоздания) Тогда
		ЭтотОбъект.ДатаСоздания = ТекущаяДатаСеанса();		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.СтатусыСобытия.Подтверждена;
	КонецЕсли;
	
	// Если Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда
	//	ТелефонныйЗвонок = Истина;
	// КонецЕсли;
		
	ИнициализироватьДополнительныеСвойстваОбъекта();
	
	СформироватьМассивСотрудниковДляФормированияИнтервалов();
	
	// Актуализировать комментарий (предназначено при программной генерации текущего объекта)
	ИнициализироватьКомментарий();
	
	// Устанавливаем ссылку новой сделки
	ПоместитьСсылкуНовойСделки();
	
	ЗаполнитьВременныеРамкиСобытия();
	
	Если НЕ Ссылка.Пустая() И ЭтотОбъект.Ссылка.Врач <> ЭтотОбъект.Врач И ЗначениеЗаполнено(Ссылка.Врач) Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ИзмененВрачПриема", Истина);
		Календарь = Справочники.КалендариСотрудников.ПолучитьКалендарьСотрудника(Ссылка.Врач);
		Если ЗначениеЗаполнено(Календарь) Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ПредыдущийКалендарь", Календарь);
        КонецЕсли;
	КонецЕсли;
	
	// Установить статусы пациента. 
	Если Не ЗначениеЗаполнено(СтатусПациента) И РежимЗаписи = РежимЗаписиДокумента.Проведение  Тогда
		УстановитьПризнакСтатусаПациента();
	КонецЕсли;
	
	Если НачалоДня(ЭтотОбъект.Дата) >= НачалоДня(ТекущаяДатаСеанса()) Тогда 		
		ПодготовитьПроверитьДанныеДляОтправкиPushУведомлений();
	КонецЕсли;
	
	РегистрыСведений.ИсторияПереносовСобытий.ЗафиксироватьИзмененияСобытияВИстории(ЭтотОбъект);
	
КонецПроцедуры

// Процедура, обработчик события "ПриЗаписи".
//
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка
		ИЛИ (ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбменДаннымиЗагрузка")
		И ЭтотОбъект.ДополнительныеСвойства.ОбменДаннымиЗагрузка = Истина) Тогда
		
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "РаботаСЧатБотом", Ложь) Тогда 
		Документы.Событие.УстановитьЗаданияВыполненным(Ссылка);
	КонецЕсли;
	
	Если НЕ ПривилегированныйРежим() Тогда 
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;	
					
	СформироватьИнтервалыПоСотрудникам();  
	
	//Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ДобавитьТелефонСуществующемуПациенту") Тогда
	//	Попытка
	//		КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	//		Справочники.Контрагенты.ДобавитьНомерТелефонаВКонтактнуюИнформациюКлиента(КонтрагентОбъект, ЭтотОбъект.ДополнительныеСвойства.ДобавитьТелефонСуществующемуПациенту); 	
	//		КонтрагентОбъект.Записать();  

	//	Исключение
	//		
	//	КонецПопытки;
	//КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ПредыдущийКалендарь") Тогда 
		ИзменитьЗаписиДанныеЗаписейКалендаряGoogle(ЭтотОбъект.ДополнительныеСвойства.ПредыдущийКалендарь);	
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Врач) Тогда
		Календарь = Справочники.КалендариСотрудников.ПолучитьКалендарьСотрудника(ЭтотОбъект.Врач);
		Если ЗначениеЗаполнено(Календарь) Тогда
			ОбменСGoogle.ПриЗаписиИсточникаЗаписиКалендаря(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
	АктуализироватьДанныеПланированияПриема();
	СоздатьНовуюВоронку();
	СменитьЭтапПредопределеннойВоронки();
	АктуализироватьВрачаСделки();
	РегистрыСведений.КонтрагентыСведенияДляСписка.АктуализироватьСведенияДляСписка(Контрагент);
	РегистрыСведений.СделкиСведенияДляСписка.АктуализироватьСведенияДляСписка(Сделка, Контрагент);	
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ТаблицаМетокДляЗаписи") 
		И ЗначениеЗаполнено(ЭтотОбъект.ДополнительныеСвойства.ТаблицаМетокДляЗаписи) Тогда
		
		РегистрыСведений.МеткиКлиентов.ЗаписатьИзмененияМеток(ЭтотОбъект, ЭтотОбъект.ДополнительныеСвойства.ТаблицаМетокДляЗаписи);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Контрагент) И ЗначениеЗаполнено(ЭтотОбъект.Врач) И ЗначениеЗаполнено(ЭтотОбъект.СтруктурнаяЕдиница) Тогда
		РегистрыСведений.ИнтервалыЛистаОжидания.УдалитьПациентаИзЛистаОжидания(ЭтотОбъект.СтруктурнаяЕдиница, ЭтотОбъект.Врач, ЭтотОбъект.Контрагент);	
	КонецЕсли;
	
	Если НачалоДня(ЭтотОбъект.Дата) >= НачалоДня(ТекущаяДатаСеанса()) Тогда
		ОбработатьОтправкуPushУведомлений();		
	КонецЕсли;
	
	ДобавитьСообщениеВСистемуВзаимодействия();
		
КонецПроцедуры

// Процедура - Изменить записи данные записей календаря google
//
Процедура ИзменитьЗаписиДанныеЗаписейКалендаряGoogle(ПредыдущийКалендарь)
	
	Запись = РегистрыСведений.ДанныеЗаписейКалендаряGoogle.СоздатьМенеджерЗаписи();
	Запись.Источник = ЭтотОбъект.Ссылка;
	Запись.Прочитать();
		
	Запись.ПредыдущийКалендарь = ПредыдущийКалендарь;
	Запись.Записать();                      
	
КонецПроцедуры

// Процедура - Обработка удаления проведения.
//
// Параметры:
//  Отказ	 - 	 - 
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// очищаем реквизит статус 
	ЭтотОбъект.СтатусПациента = Неопределено;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура, заполняет даты начала и окончания события.
//
Процедура ЗаполнитьВременныеРамкиСобытия()
	
	Если ЭтотОбъект.Услуги.Количество() Тогда
		
		Начало		 = ЭтотОбъект.Услуги[0].ДатаНачала;
		Окончание	 = ЭтотОбъект.Услуги[0].ДатаОкончания;
		
		Для Каждого Услуга Из ЭтотОбъект.Услуги Цикл
			Начало		 = ?(Начало > Услуга.ДатаНачала, Услуга.ДатаНачала, Начало);
			Окончание	 = ?(Окончание < Услуга.ДатаОкончания, Услуга.ДатаОкончания, Окончание);
		КонецЦикла;
		
		ЭтотОбъект.Дата			 = Начало;
		ЭтотОбъект.ДатаОкончания = Окончание;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Сформировать массив сотрудников для формирования интервалов
//
Процедура СформироватьМассивСотрудниковДляФормированияИнтервалов()
	
	МассивСотрудников = Новый Массив;
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.Услуги Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Сотрудник)
			И МассивСотрудников.Найти(СтрокаТЧ.Сотрудник) = Неопределено Тогда
			МассивСотрудников.Добавить(СтрокаТЧ.Сотрудник);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаТЧ.Сотрудник) И (НЕ ЗначениеЗаполнено(ЭтотОбъект.Врач) ИЛИ ЭтотОбъект.Врач <> СтрокаТЧ.Сотрудник) Тогда
			Врач = СтрокаТЧ.Сотрудник;
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.Ссылка.Услуги Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Сотрудник)
			И МассивСотрудников.Найти(СтрокаТЧ.Сотрудник) = Неопределено Тогда
			МассивСотрудников.Добавить(СтрокаТЧ.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	ЭтотОбъект.ДополнительныеСвойства.Вставить("СотрудникиДляФормированияИнтервалов", МассивСотрудников);
	
КонецПроцедуры	

// Процедура - Сформировать интервалы по сотрудникам
//
Процедура СформироватьИнтервалыПоСотрудникам()
	
	Если НачалоДня(ЭтотОбъект.Дата) >= НачалоДня(ТекущаяДатаСеанса())
		И ЭтотОбъект.ДополнительныеСвойства.Свойство("СотрудникиДляФормированияИнтервалов")
		И ЗначениеЗаполнено(ЭтотОбъект.ДополнительныеСвойства.СотрудникиДляФормированияИнтервалов) Тогда
		
		МассивСотрудников = ЭтотОбъект.ДополнительныеСвойства.СотрудникиДляФормированияИнтервалов;
		РегистрыСведений.СвободныеИнтервалыСотрудников.СформироватьИнтервалыПоСотрудникам(
			СтруктурнаяЕдиница, МассивСотрудников, НачалоДня(ЭтотОбъект.Дата), КонецДня(ЭтотОбъект.Дата));
			
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Инициализировать комментарий
//
Процедура ИнициализироватьКомментарий()

	Если НЕ ЭтотОбъект.Ссылка.Пустая() ИЛИ НЕ ЗначениеЗаполнено(ЭтотОбъект.Сделка) ИЛИ ЗначениеЗаполнено(СокрЛП(ЭтотОбъект.Комментарий)) Тогда
		Возврат;
	КонецЕсли;
	
	//ЭтотОбъект.Комментарий = СокрЛП(ОбщегоНазначения.ПолучитьЗначениеРеквизита(ЭтотОбъект.Сделка, "Описание"));	
	
КонецПроцедуры

// Процедура - Поместить ссылку новой сделки
//
Процедура ПоместитьСсылкуНовойСделки()
	
	Если НЕ ЭтотОбъект.Ссылка.Пустая() ИЛИ ЗначениеЗаполнено(Сделка) Тогда
		Возврат;
	КонецЕсли;	
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ВидСделкиГенерации") И ЗначениеЗаполнено(ЭтотОбъект.ДополнительныеСвойства.ВидСделкиГенерации) Тогда
		Если НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("СсылкаНовойСделки") Тогда
			СсылкаНовойСделки = Справочники.Сделки.ПолучитьСсылку(Новый УникальныйИдентификатор);
			ЭтотОбъект.ДополнительныеСвойства.Вставить("СсылкаНовойСделки", СсылкаНовойСделки);
			ЭтотОбъект.Сделка = СсылкаНовойСделки;				
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

// Процедура - Актуализировать данные планирования приема
//
Процедура АктуализироватьДанныеПланированияПриема()

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Сделка) ИЛИ НЕ ОбщегоНазначения.СсылкаСуществует(ЭтотОбъект.Сделка) Тогда 
		Возврат;
	КонецЕсли;
	
	ДанныеПередЗаписью = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "ДанныеПередЗаписью", Неопределено);
	Если ЗначениеЗаполнено(ДанныеПередЗаписью) И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПередЗаписью, "ЭтоНовый") Тогда 
		РегистрыСведений.Профосмотры.АктуализироватьСтатусПланированияПриема(ЭтотОбъект.СтруктурнаяЕдиница
																			, ЭтотОбъект.Контрагент
																			, ЭтотОбъект.Сделка
																			, ЭтотОбъект.Ссылка
																			, Перечисления.СтатусыПрофосмотров.Согласился);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Создать новую сделку
//
Процедура СоздатьНовуюВоронку()
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ВидСделкиГенерации") И ЗначениеЗаполнено(ЭтотОбъект.ДополнительныеСвойства.ВидСделкиГенерации) И ЭтотОбъект.ДополнительныеСвойства.Свойство("СсылкаНовойСделки") Тогда
		ДанныеЗаполнения = ЗначениеИзСтрокиВнутр(ЗначениеВСтрокуВнутр(ЭтотОбъект.ДополнительныеСвойства));
		ДанныеЗаполнения.Вставить("ВидСделки"				, ДанныеЗаполнения.ВидСделкиГенерации);
		// ДанныеЗаполнения.Вставить("ДатаСделки"			, ЭтотОбъект.Дата);
		ДанныеЗаполнения.Вставить("Контрагент"				, ЭтотОбъект.Контрагент);
		ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница"		, ЭтотОбъект.СтруктурнаяЕдиница);
		ДанныеЗаполнения.Вставить("ЭтапСделки"				, ДанныеЗаполнения.ЭтапСделкиГенерации);
		Если НЕ ЭтотОбъект.Услуги.Количество() = 0 Тогда 
			ДанныеЗаполнения.Вставить("Врач"				, ЭтотОбъект.Услуги[0].Сотрудник);
		КонецЕсли;
		ДанныеЗаполнения.Вставить("ИнтерактивнаяЗапись"		, Истина);
		ДанныеЗаполнения.Вставить("СформироватьНаименование", Истина);		
		Если ЗначениеЗаполнено(ВходящийНомерТелефона) Тогда
			ДанныеЗаполнения.Вставить("ВходящийНомерТелефона", ЭтотОбъект.ВходящийНомерТелефона)	
		КонецЕсли;
		НоваяСделка = Справочники.Сделки.СоздатьНовуюСделку(ДанныеЗаполнения, Истина);
	КонецЕсли;

КонецПроцедуры

// Процедура - Сменить этап предопределенной сделки
//
Процедура СменитьЭтапПредопределеннойВоронки()
	
	Если (ЭтотОбъект.Проведен ИЛИ УстановкаПометкиУдаленияЗаписи()) И ЗначениеЗаполнено(ЭтотОбъект.Сделка) Тогда 
		ДанныеСделки = ОбщегоНазначенияСтоматология.ПолучитьЗначенияРеквизитов(ЭтотОбъект.Сделка, "СтруктурнаяЕдиница, ВидСделки, ЭтапСделки, РезультатСделки");
		Если НЕ ЗначениеЗаполнено(ДанныеСделки.РезультатСделки) И ЗначениеЗаполнено(ДанныеСделки.ВидСделки) И ОбщегоНазначенияСтоматология.ПолучитьЗначениеРеквизита(ДанныеСделки.ВидСделки, "Предопределенный") = Истина Тогда 
			СтатусПЗ = Неопределено;
			АктуальныйЭтап = Справочники.Сделки.ПолучитьАктуальныйЭтапВоронки(ЭтотОбъект.Сделка, ДанныеСделки.ВидСделки, ЭтотОбъект.Контрагент, СтатусПЗ);
			Если ЗначениеЗаполнено(АктуальныйЭтап) И НЕ ДанныеСделки.ЭтапСделки = АктуальныйЭтап Тогда 
				Справочники.Сделки.УстановитьЭтапСделке(ЭтотОбъект.Сделка
														, АктуальныйЭтап
														, Истина
														, ?(ЗначениеЗаполнено(ЭтотОбъект.Врач), ЭтотОбъект.Врач, ?(ЭтотОбъект.Услуги.Количество() = 0, ЭтотОбъект.Врач, ЭтотОбъект.Услуги[0].Сотрудник))
														, СтатусПЗ
														, ?(ЭтотОбъект.ПометкаУдаления ИЛИ НЕ ЭтотОбъект.Проведен, НСтр("ru= 'Ошибка';en= 'Mistake'"), Неопределено)
														,
														, ?(ЭтотОбъект.СтруктурнаяЕдиница <> ДанныеСделки.СтруктурнаяЕдиница, ЭтотОбъект.СтруктурнаяЕдиница, Неопределено));
				// Строчка выше - актуализация этапа - всегда актуализирует и врача в сделке
				// Потому ниже это делать уже не надо - флаг удаляем
				Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ИзмененВрачПриема") Тогда 
					ЭтотОбъект.ДополнительныеСвойства.Удалить("ИзмененВрачПриема");
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

// Функция - Установка пометки удаления записи
// 
// Возвращаемое значение:
//   - 
//
Функция УстановкаПометкиУдаленияЗаписи()

	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ДанныеПередЗаписью") Тогда 
		Если НЕ ЭтотОбъект.ПометкаУдаления = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства.ДанныеПередЗаписью, "ПометкаУдаления", Ложь) Тогда 
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Процедура - Актуализировать врача сделки
//
Процедура АктуализироватьВрачаСделки()

	Если ЗначениеЗаполнено(ЭтотОбъект.Сделка) И ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "ИзмененВрачПриема", Ложь) Тогда 
		Справочники.Сделки.СменитьВрачаВСделке(ЭтотОбъект.Сделка, ?(ЗначениеЗаполнено(ЭтотОбъект.Врач), ЭтотОбъект.Врач, ?(ЭтотОбъект.Услуги.Количество() = 0, ЭтотОбъект.Врач, ЭтотОбъект.Услуги[0].Сотрудник)), Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Добавить сообщение в систему взаимодействия
//
Процедура ДобавитьСообщениеВСистемуВзаимодействия()
		
	Параметры = Новый Структура();
	Параметры.Вставить("Событие"				, ЭтотОбъект.Ссылка);
	Параметры.Вставить("ДополнительныеСвойства"	, Общегоназначения.СкопироватьРекурсивно(ЭтотОбъект.ДополнительныеСвойства));
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоНовый") 
		И ЭтотОбъект.ДополнительныеСвойства.ЭтоНовый = Истина Тогда
	 	
		Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(, "Документы.Событие.ДобавитьСообщениеВСистемуВзаимодействия", Параметры);
	Иначе
		Документы.Событие.ДобавитьСообщениеВСистемуВзаимодействия(Параметры);
	КонецЕсли;	
	
КонецПроцедуры 

// Процедура - Инициализировать дополнительные свойства объекта
//
Процедура ИнициализироватьДополнительныеСвойстваОбъекта()
	
	Если НЕ ЭтотОбъект.Ссылка.Пустая() Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ИзмененСтатусЗаписи", ЭтотОбъект.Статус <> ЭтотОбъект.Ссылка.Статус И ЗначениеЗаполнено(ЭтотОбъект.Статус));
		Если ЭтотОбъект.Ссылка.Статус = Перечисления.СтатусыСобытия.НеПодтверждена
			И ЭтотОбъект.Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда
			ЭтотОбъект.ДополнительныеСвойства.Вставить("ПроизвестиИнформированиеКлиентаПодтверждениеОнЛайнЗаписи", Истина);
		КонецЕсли; 
		
		Если ЭтотОбъект.ДополнительныеСвойства.ИзмененСтатусЗаписи Тогда 
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

// Устанвоить статусы пациента в документе
Процедура УстановитьПризнакСтатусаПациента()
		
	Запрос       = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Пациент КАК Пациент,
	|	СУММА(ЕСТЬNULL(ВложенныйЗапрос.РанееБылиПриемы, 0)) КАК РанееБылиПриемы
	|ИЗ
	|	(ВЫБРАТЬ ПЕРВЫЕ 1
	|		Продажи.Контрагент КАК Пациент,
	|		1 КАК РанееБылиПриемы
	|	ИЗ
	|		РегистрНакопления.Продажи КАК Продажи
	|	ГДЕ
	|		Продажи.Контрагент = &Контрагент
	|		И Продажи.Период < &Дата
	|		И Продажи.Регистратор ССЫЛКА Документ.Прием) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Пациент";
	
	Запрос.УстановитьПараметр("Контрагент"        , ЭтотОбъект.Контрагент);
	Запрос.УстановитьПараметр("Дата"              , ?(НЕ ЗначениеЗаполнено(ЭтотОбъект.Дата) Или НачалоДня(ЭтотОбъект.Дата) = НачалоДня(ТекущаяДата()), ТекущаяДата(), ЭтотОбъект.Дата)); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если Выборка.РанееБылиПриемы = 1 Тогда
			ЭтотОбъект.СтатусПациента = Перечисления.СтатусыКонтрагентов.Постоянный;
		Иначе
			ЭтотОбъект.СтатусПациента = Перечисления.СтатусыКонтрагентов.Первичный;
		КонецЕсли;
						
	Иначе
		ЭтотОбъект.СтатусПациента = Перечисления.СтатусыКонтрагентов.Первичный;		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Подготовить проверить данные для отправки push уведомлений
//
Процедура ПодготовитьПроверитьДанныеДляОтправкиPushУведомлений()
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("НеОтправлятьПушУведомление") Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиМобильногоПриложенияСтоматологии = Константы.НастройкиМобильногоПриложенияСтоматологии.Получить().Получить();
	
	Если НастройкиМобильногоПриложенияСтоматологии = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УведомлятьВрачаОбИзмененииПриемов = НастройкиМобильногоПриложенияСтоматологии.Свойство("УведомлятьВрачаОбИзмененииПриемов") И НастройкиМобильногоПриложенияСтоматологии.УведомлятьВрачаОбИзмененииПриемов;
	
	Если НЕ УведомлятьВрачаОбИзмененииПриемов Тогда
		Возврат;
	КонецЕсли;
	
	ВнешняяСистема = Справочники.ВнешниеСистемы.ПолучитьВнешнююСистему(, Перечисления.ТипыВнешнихСистем.МобильноеПриложениеУправляющего, Истина);
	
	Если НЕ ЗначениеЗаполнено(ВнешняяСистема) Тогда
		Возврат;
	КонецЕсли;
		
	МассивСотрудников = Новый Массив;
	МассивКлючейСотрудников = Новый Массив;
	МассивВыгруженныхСотрудников = ЭтотОбъект.Услуги.ВыгрузитьКолонку("Сотрудник");		
	МассивВыгруженныхСотрудниковДоИзменения = Ссылка.Услуги.ВыгрузитьКолонку("Сотрудник");	
	
	Для Каждого СтрокаМ Из МассивВыгруженныхСотрудников Цикл
		
		Если ЗначениеЗаполнено(СтрокаМ) И МассивСотрудников.Найти(СтрокаМ) = Неопределено И РегистрыСведений.КлючиВнешнихСистем.СотрудникЗарегистрированДляВнешнейСистемы(СтрокаМ, Истина, ВнешняяСистема) Тогда
			МассивСотрудников.Добавить(СтрокаМ);
			МассивКлючейСотрудников.Добавить(РегистрыСведений.КлючиВнешнихСистем.ПолучитьПараметрыСотрудника(ВнешняяСистема, СтрокаМ).КлючКлиента);
		КонецЕсли;
		
	КонецЦикла;
	
	СтатусИзменился			 = ЭтотОбъект.Статус <> Ссылка.Статус;
	СтатусИзменилсяНаОтменен = СтатусИзменился И ЭтотОбъект.Статус = Перечисления.СтатусыСобытия.ПриемОтменен; 
	СтатусИзменилсяНаПришел  = СтатусИзменился И ЭтотОбъект.Статус = Перечисления.СтатусыСобытия.ПриемНачат;
	
	Если СтатусИзменилсяНаОтменен Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("ЭтоОтмененный", Истина);
	ИначеЕсли СтатусИзменилсяНаПришел Тогда
		ЭтотОбъект.ДополнительныеСвойства.Вставить("СтатусКлиентПришел", Истина);
	Иначе
		
		Если Дата <> Дата(1,1,1) И Ссылка.Дата <> Дата Тогда
			ДополнительныеСвойства.Вставить("ЗаписьПеренесенаС" , Ссылка.Дата);
			ДополнительныеСвойства.Вставить("ЗаписьПеренесенаНа", Дата);
		КонецЕсли;
		
		ЗаписьПеренесенаССотрудников  = Новый Массив;
		ЗаписьПеренесенаНаСотрудников = Новый Массив;
		
		Для Каждого СтрокаМ Из МассивВыгруженныхСотрудниковДоИзменения Цикл
			
			Если МассивВыгруженныхСотрудников.Найти(СтрокаМ) = Неопределено И РегистрыСведений.КлючиВнешнихСистем.СотрудникЗарегистрированДляВнешнейСистемы(СтрокаМ, Истина, ВнешняяСистема) Тогда
				
				КлючСотрудника = РегистрыСведений.КлючиВнешнихСистем.ПолучитьПараметрыСотрудника(ВнешняяСистема, СтрокаМ).КлючКлиента;  
				Если МассивКлючейСотрудников.Найти(КлючСотрудника) = Неопределено Тогда 
					МассивКлючейСотрудников.Добавить(КлючСотрудника);
				КонецЕсли;
				Если ЗаписьПеренесенаССотрудников.Найти(КлючСотрудника) = Неопределено Тогда
					ЗаписьПеренесенаССотрудников.Добавить(КлючСотрудника);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаМ Из МассивВыгруженныхСотрудников Цикл
			
			Если МассивВыгруженныхСотрудниковДоИзменения.Найти(СтрокаМ) = Неопределено И РегистрыСведений.КлючиВнешнихСистем.СотрудникЗарегистрированДляВнешнейСистемы(СтрокаМ, Истина, ВнешняяСистема) Тогда
				
				КлючСотрудника = РегистрыСведений.КлючиВнешнихСистем.ПолучитьПараметрыСотрудника(ВнешняяСистема, СтрокаМ).КлючКлиента;  
				Если МассивКлючейСотрудников.Найти(КлючСотрудника) = Неопределено Тогда 
					МассивКлючейСотрудников.Добавить(КлючСотрудника);
				КонецЕсли;
				Если ЗаписьПеренесенаНаСотрудников.Найти(КлючСотрудника) = Неопределено Тогда
					ЗаписьПеренесенаНаСотрудников.Добавить(КлючСотрудника);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(ЗаписьПеренесенаССотрудников) ИЛИ ЗначениеЗаполнено(ЗаписьПеренесенаНаСотрудников) Тогда
			ДополнительныеСвойства.Вставить("ЗаписьПеренесенаССотрудников" , ЗаписьПеренесенаССотрудников);		
			ДополнительныеСвойства.Вставить("ЗаписьПеренесенаНаСотрудников", ЗаписьПеренесенаНаСотрудников);
			ДополнительныеСвойства.Вставить("ЭтоИзменениеСотрудников"	   , Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	Если МассивКлючейСотрудников.Количество() > 0 Тогда 
		ЭтотОбъект.ДополнительныеСвойства.Вставить("МассивКлючейСотрудников", МассивКлючейСотрудников);
		ЭтотОбъект.ДополнительныеСвойства.Вставить("КлючПриложения"	        , ВнешняяСистема.КлючПриложения);
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Обработать отправку push уведомлений
//
Процедура ОбработатьОтправкуPushУведомлений()
	
	УстановитьПривилегированныйРежим(Истина);	
	ДанныеАнкеты = ЛичныйКабинет.ПолучитьДанныеРегистрационнойАнкеты();	
	УстановитьПривилегированныйРежим(Ложь);
		
	Если НЕ ЗначениеЗаполнено(ДанныеАнкеты) 
		ИЛИ НЕ ДанныеАнкеты.Свойство("ПродуктРегистрационныйНомер") 
		ИЛИ НЕ ЗначениеЗаполнено(ДанныеАнкеты.ПродуктРегистрационныйНомер) 
		ИЛИ НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("МассивКлючейСотрудников") 
		ИЛИ НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоОтмененный") 
		И НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьПеренесенаС")
		И НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоИзменениеСотрудников") 
		И НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусКлиентПришел") Тогда
		
		Возврат;
		
	КонецЕсли;
	
	СтруктураPushУведомления = Новый Структура();
	
	СтруктураPushУведомления.Вставить("УидВизита"              		 , Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор()));
	СтруктураPushУведомления.Вставить("УидСалона"              		 , Строка(ЭтотОбъект.СтруктурнаяЕдиница.УникальныйИдентификатор()));
	СтруктураPushУведомления.Вставить("НачалоВизита"           		 , ЭтотОбъект.Дата);
	СтруктураPushУведомления.Вставить("ОкончаниеВизита"        		 , ЭтотОбъект.ДатаОкончания);
	СтруктураPushУведомления.Вставить("ЭтоНовый"               		 , Ложь);	
	СтруктураPushУведомления.Вставить("ЭтоОтмененный"          		 , ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоОтмененный")     , ЭтотОбъект.ДополнительныеСвойства.ЭтоОтмененный     , Ложь));
	СтруктураPushУведомления.Вставить("ЗаписьПеренесенаС"      		 , ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьПеренесенаС") , ЭтотОбъект.ДополнительныеСвойства.ЗаписьПеренесенаС , Дата(1,1,1)));
	СтруктураPushУведомления.Вставить("ЗаписьПеренесенаНа"     		 , ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьПеренесенаНа"), ЭтотОбъект.ДополнительныеСвойства.ЗаписьПеренесенаНа, Дата(1,1,1)));
	СтруктураPushУведомления.Вставить("МассивКлючейСотрудников"		 , ЭтотОбъект.ДополнительныеСвойства.МассивКлючейСотрудников);
	СтруктураPushУведомления.Вставить("КлючПриложения"         		 , ЭтотОбъект.ДополнительныеСвойства.КлючПриложения);
	СтруктураPushУведомления.Вставить("ПричинаОтмены"          		 , ?(СтруктураPushУведомления.ЭтоОтмененный, Строка(ЭтотОбъект.ПричинаОтмены), Неопределено));
	СтруктураPushУведомления.Вставить("ЗаписьПеренесенаССотрудников" , ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьПеренесенаССотрудников") , ЭтотОбъект.ДополнительныеСвойства.ЗаписьПеренесенаССотрудников , Неопределено));
	СтруктураPushУведомления.Вставить("ЗаписьПеренесенаНаСотрудников", ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("ЗаписьПеренесенаНаСотрудников"), ЭтотОбъект.ДополнительныеСвойства.ЗаписьПеренесенаНаСотрудников, Неопределено));
	СтруктураPushУведомления.Вставить("ЭтоИзменениеСотрудников"      , ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("ЭтоИзменениеСотрудников")		, ЭтотОбъект.ДополнительныеСвойства.ЭтоИзменениеСотрудников		 , Ложь));
	СтруктураPushУведомления.Вставить("СтатусКлиентПришел"      	 , ?(ЭтотОбъект.ДополнительныеСвойства.Свойство("СтатусКлиентПришел")			, ЭтотОбъект.ДополнительныеСвойства.СтатусКлиентПришел		 	 , Ложь));
	СтруктураPushУведомления.Вставить("ПродуктРегистрационныйНомер"	 , ДанныеАнкеты.ПродуктРегистрационныйНомер);
	СтруктураPushУведомления.Вставить("ЭтоСтоматология"	 			 , Истина);
	
	УстановитьПривилегированныйРежим(Истина);
	
	КлючФоновогоЗадания = Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор());
	
	МассивПараметров = Новый Массив();
	МассивПараметров.Добавить(СтруктураPushУведомления);
	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("Ключ, Состояние", КлючФоновогоЗадания, СостояниеФоновогоЗадания.Активно));
	
	Если МассивФоновыхЗаданий.Количество() = 0 Тогда
		ФоновыеЗадания.Выполнить("ЛичныйКабинет.ОтправитьPushУведомлениеMobile", МассивПараметров, КлючФоновогоЗадания, "Отправка push уведомлений, в отдельном потоке");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
